user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgs2D_Coarse/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1e-12;

pointSync true;

patchInfo
(
    {
        name             infinity;
        constructFrom    set;
        set              faceSet_infinity;

        dictionary
        {
            type         patch;
        }
    }

    {
        name             frontAndBack;
        constructFrom    set;
        set              faceSet_frontAndBack;

        dictionary
        {
            type         empty;
        }
    }
);

// OpenFOAM syntax
patches
(
);

// ************************************************************************* //
