user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgs2D_Coarse/system/region_conductor/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                           none;
}

gradSchemes
{
    default                           none;

    curl(A0Re)                        Gauss skewCorrected linear;
    curl(A0Im)                        Gauss skewCorrected linear;

    grad(A0Re)                        Gauss skewCorrected linear;
    grad(A0Im)                        Gauss skewCorrected linear;

divSchemes
{
    default                           none;
}

laplacianSchemes
{
    default                           none;

    laplacian(A0Re)                   Gauss linear corrected;
    laplacian(A0Im)                   Gauss linear corrected;

}

interpolationSchemes
{
    default                           none;

    interpolate(A0Re)                 skewCorrected linear;
    interpolate(A0Im)                 skewCorrected linear;

    interpolate(grad(A0Re))           skewCorrected linear;
    interpolate(grad(A0Im))           skewCorrected linear;
}

// ************************************************************************* //
